Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public virtual bool Insert(
	GenericForm item
)
  Visual Basic
Public Overridable Function Insert ( _
	item As GenericForm _
) As Boolean
  Visual C++
public:
virtual bool Insert(
	GenericForm^ item
)
 Parameters
  item
 Type:  Autodesk.Revit.DB GenericForm
 See Also
  GenericFormSet Class
  Autodesk.Revit.DB Namespace